m5stack/M5PaperMono-PowerDemo/tests/full_load/sdkconfig.defaults
# ESP-IDF 5.5.5 defaults for M5PaperMono.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_M5PM_TEST_ID="full_load"
CONFIG_M5PM_CONFIG_ID="full_load"
# CONFIG_M5PM_FULL_LOAD_ENABLE is not set
CONFIG_M5PM_FULL_LOAD_WIFI_SSID=""
CONFIG_M5PM_FULL_LOAD_WIFI_PASSWORD=""
CONFIG_M5PM_FULL_LOAD_RUNTIME_SECONDS=600
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
